src/cf/InformationRegisters/пр_ОбращенияВСлужбуПоддержки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>пр_ОбращенияВСлужбуПоддержки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОбращения</Name>
					<Comment>0 : пожелание, 1 : ошибка, 2 : вопрос</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеРоли</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидаемаяЦель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическоеПоведение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозможноПредоставлениеБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласиеОтправитьСведенияОПродукте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Прикрепления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/пр_ПоддержкаОтраслевыхРешенийПереопределяемый/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при заполнении контактной информации о службе поддержки продукта
//
// Параметры:
//  ГрафикРаботы - Строка - график работы службы поддержки
//  Контакты     - Массив - Соответствие, где "Ключ" это заголовок поля
//  Сайты        - Массив - набор сайтов (строки или форматированные строки)
//
Процедура ПриПолученииКонтактовСлужбыПоддержки(ГрафикРаботы, Контакты, Сайты) Экспорт
	
	// Сведения о графике работы
	ГрафикРаботы = НСтр("ru = '10:00 - 18:00, без перерывов,"
"кроме субботы и воскресенья'; en = '10:00 AM - 6:00 PM, no breaks,"
"except Saturday and Sunday'");
	
	// Сведения о контактах
	пр_ПоддержкаОтраслевыхРешений.ДобавитьОписаниеКонтакта(Контакты,
		НСтр("ru = 'Телефон'; en = 'Telephone'"), "+7 (495) 223-04-04, доб. 4264");
	пр_ПоддержкаОтраслевыхРешений.ДобавитьОписаниеКонтакта(Контакты,
		НСтр("ru = 'Эл. почта'; en = 'Эл. почта'"), "auto@rarus.ru");
	
	// Сведения о связанных информационных ресурсах
	Сайты.Добавить(Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока("rarus.ru", Новый Шрифт(,,,,Истина), ОбщегоНазначенияВызовСервера.ЦветСтиля("ГиперссылкаЦвет"),, "https://rarus.ru/1c-transport/"),
		НСтр("ru = ' - программы для автоматизации учета в транспортных, логистических и экспедиторских компаниях.'; en = '- programs for automating accounting in transport, logistics and freight forwarding companies.'")));
	
	Если НЕ ПустаяСтрока(Метаданные.АдресИнформацииОКонфигурации)
		И СтрНайти(Метаданные.АдресИнформацииОКонфигурации, "solutions.1c.ru") <> Неопределено Тогда
		Сайты.Добавить(Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока("solutions.1c.ru", Новый Шрифт(,,,,Истина), ОбщегоНазначенияВызовСервера.ЦветСтиля("ГиперссылкаЦвет"),, Метаданные.АдресИнформацииОКонфигурации),
			НСтр("ru = ' - общая информация о программном продукте.'; en = '- general information about the software product.'")));
	КонецЕсли;
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		АдресДокументации = "https://its.1c.ru/db/uatstd22"
	ИначеЕсли уатОбщегоНазначенияПовтИсп.ВариантПоставкиПРОФ()
		Или уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		Или уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		АдресДокументации = "https://its.1c.ru/db/uattle";
	КонецЕсли;
	Сайты.Добавить(Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока("its.1c.ru", Новый Шрифт(,,,,Истина), ОбщегоНазначенияВызовСервера.ЦветСтиля("ГиперссылкаЦвет"),, АдресДокументации),
		НСтр("ru = ' - документация по программному продукту на портале 1С:ИТС.'; en = '- documentation for the software product on the 1C:ITS portal.'")));
	
	Сайты.Добавить(Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока("rutube.com", Новый Шрифт(,,,,Истина), ОбщегоНазначенияВызовСервера.ЦветСтиля("ГиперссылкаЦвет"),, "https://rutube.ru/plst/234103/"),
		НСтр("ru = ' - канал компании «1С-Рарус» на Rutube. Решения для автоматизации транспорта.'; en = '- 1C-Rarus channel on Rutube. Solutions for transport automation.'")));
	
	Сайты.Добавить(Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока("youtube.com", Новый Шрифт(,,,,Истина), ОбщегоНазначенияВызовСервера.ЦветСтиля("ГиперссылкаЦвет"),, "https://www.youtube.com/watch?v=q_gZSVSOcLw&list=PLCxkw0ZvwZab5EUWsbDK63nwjCEDqK9mt"),
		НСтр("ru = ' - канал компании «1С-Рарус» на YouTube. Решения для автоматизации транспорта.'; en = '- 1C-Rarus YouTube channel. Solutions for transport automation.'")));
	
	Сайты.Добавить(Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока("learn.rarus.ru", Новый Шрифт(,,,,Истина), ОбщегоНазначенияВызовСервера.ЦветСтиля("ГиперссылкаЦвет"),, "https://learn.rarus.ru/courses/10766/"),
		НСтр("ru = ' - 1С-Рарус.Центр онлайн-обучения. Онлайн курсы по программным продуктам.'; en = '- 1C-Rarus. Online training center. Online courses on software products.'")));
		
	Сайты.Добавить(Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока("Подписка на рассылку", Новый Шрифт(,,,,Истина), ОбщегоНазначенияВызовСервера.ЦветСтиля("ГиперссылкаЦвет"),, "https://rarus.ru/my/mailing/"),
		НСтр("ru = ' - подписка на рассылку по вебинарам, новостям и релизам. Установите флаг «Транспорт, Логистика», чтобы получать новости вашей программы. Письма приходят не чаще 1 раза в 2 недели.'")));
	
КонецПроцедуры // ПриПолученииКонтактовСлужбыПоддержки()

// Вызывается при идентификации бизнес-роли пользователя
//
// Параметры:
//  БизнесРольПользователя - Строка - Наименование бизнес-роли пользователя для передачи в службу поддержки.
//  Пользователь           - СправочникСсылка.Пользователи - Пользователь, от имени которого выполняется
//      обращение в службу поддержки.
//
Процедура ПриПолученииБизнесРолиПользователя(БизнесРольПользователя, Пользователь) Экспорт
	
	
КонецПроцедуры // ПриПолученииБизнесРолиПользователя()

// Вызывается при расчете значения ключа данных замеров отраслевой бизнес статистики.
//
Процедура ПриПолученииКлючаДанныхЗамеровСтатистики(КлючДанных, ТипЗаписи, ИмяОперации, Параметры) Экспорт
	
	// Макисмальная длина строкового ключа данных - 100 символов,
	// как в измерении "Ключ" регистра сведений "ЗамерыСтатистики".
	// Формат ключа: <ПрефиксВидаКлюча> + <ДанныеКлюча>.
	// Длина ПрефиксВидаКлюча - 1 символ, ДанныеКлюча - до 99 символов.
	
	ПрефиксВидаКлюча = "0";
	
	// ПрефиксВидаКлюча = "0": данные ключа содержат до трех строк фиксированной длины 32 символа -
	// MD5 хешей или уникальных идентификаторов с удаленными дефисами.
	// Каждая из этих строк предваряется односимвольным префиксом, указывающими на тип передаваемых в строке данных.
	// Формат данных ключа: <ПрефиксТипа1> + <Строка1> [ + ПрефиксТипа2> + <Строка2> [ + <ПрефиксТипа3> + <Строка3>]]
	
	ПрефиксТипаДанных = "1";
	
	// ПрефиксТипаДанных = "0": передается идентификатор пользователя ИБ.
	// ПрефиксТипаДанных = "1": передается идентификатор бизнес роли пользователя.
	
КонецПроцедуры // ПриПолученииКлючаДанныхЗамеровСтатистики()

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма                - ФормаКлиентскогоПриложения - Форма контактов службы поддержки.
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - Признак выполнения стандартной (системной) обработки события.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ПрикрепленияХЗ = Неопределено) Экспорт
	
	Если Форма.ИмяФормы = "РегистрСведений.пр_ОбращенияВСлужбуПоддержки.Форма.Обращение" Тогда
		// Инициализируем новый объект
		Если ПустаяСтрока(Форма.Запись.Идентификатор) Тогда
			
			Если Форма.Запись.ВидОбращения = 3 Тогда
				// Заявка на подключение маршрутизации
				Форма.Запись.Тема = НСтр("ru = 'Маршрутизация Rarus VRP'; en = 'Request for connection to Rarus VRP routing'");  
				//Форма.Запись.ОписаниеДействия = НСтр("ru = 'Прошу предоставить тестовый доступ к сервису маршрутизации ""Rarus VRP"" для ознакомления с возможностями алгоритма'; en = ""I request test access to the Rarus VRP routing service to familiarize myself with the algorithm's capabilities.""")
				//	+ Форма.Запись.ОписаниеДействия; 
				Форма.Запись.ОжидаемаяЦель = "---";
				Форма.Элементы.ОжидаемаяЦель.Видимость = Ложь;
			ИначеЕсли Форма.Запись.ВидОбращения = 4 Тогда
				Форма.Запись.Тема = НСтр("en = 'Application for connecting the mobile application ""UAT Driver""'; ru = 'Мобильное приложение ""Водитель УАТ""'");
				//Форма.Запись.Тема = 0;
				//Форма.Запись.ОписаниеДействия = НСтр("en = 'I request you to contact me regarding the purchase of and consultation on the ""UAT Driver"" mobile application.'; ru = 'Прошу связаться со мной для приобретения и консультации по мобильному приложению ""Водитель УАТ""'")
				//	+ Форма.Запись.ОписаниеДействия;
				Форма.Запись.ОжидаемаяЦель = "---";
				
				Форма.Элементы.ОжидаемаяЦель.Видимость = Ложь;
				Форма.Элементы.Информация.Видимость = Истина;
				Форма.Элементы.Информация.Заголовок = Новый ФорматированнаяСтрока(Нстр("ru = 'Информация о мобильном приложении'"),,,,
				"https://rarus.ru/1c-transport/1c-rarus-mobilnoe-prilozhenie-voditel-uat/?utm_source=1c.uat&utm_medium=banner&utm_campaign=DOR-OAA-tle-voditel-uat-1c-app");
			ИначеЕсли Форма.Запись.ВидОбращения = 5 Тогда
				// Заявка на подключение маршрутизации
				Форма.Запись.Тема = НСтр("ru = 'Электронные перевозочные документы'");
				//Форма.Запись.ОписаниеДействия = НСтр("ru = 'Прошу предоставить тестовый доступ к сервису маршрутизации ""Rarus VRP"" для ознакомления с возможностями алгоритма'; en = ""I request test access to the Rarus VRP routing service to familiarize myself with the algorithm's capabilities.""")
				//	+ Форма.Запись.ОписаниеДействия; 
				Форма.Запись.ОжидаемаяЦель = "---";
			КонецЕсли;
			
		КонецЕсли;
		
		ЭтоПожелание                        = Форма.Запись.ВидОбращения = 0;
		ЭтоОшибка                           = Форма.Запись.ВидОбращения = 1;
		ЭтоВопрос                           = Форма.Запись.ВидОбращения = 2;
		ЭтоЗавякаНаПодключениеМаршрутизации = Форма.Запись.ВидОбращения = 3;
		ЭтоЗавякаНаПодключениеВодительУАТ   = Форма.Запись.ВидОбращения = 4;
		ЭтоЗавякаНаПодключениеЭТрН          = Форма.Запись.ВидОбращения = 5;
		
		// Производим адаптацию формы под конкретный вид обращения
		Форма.Элементы.ВидОбращения.Видимость = ЭтоПожелание Или ЭтоОшибка Или ЭтоВопрос;
		
		Если ЭтоЗавякаНаПодключениеМаршрутизации
			ИЛИ ЭтоЗавякаНаПодключениеВодительУАТ
			ИЛИ ЭтоЗавякаНаПодключениеЭТрН Тогда
			Форма.Элементы.ОписаниеДействия.Заголовок = НСтр("ru = 'Комментарий'; en = 'Commentary'");
			Форма.Элементы.ОписаниеДействия.ПодсказкаВвода = НСтр("ru = 'Укажите любую дополнительную информацию'");
			//Форма.ОтображатьЗаголовок = Ложь;
			Форма.Элементы.ТемаЗаголовок.Заголовок = НСтр("ru='Сервис для подключения'");
			Форма.Элементы.ТемаЗаголовок.ОтображатьЗаголовок = Истина;
			Форма.Элементы.ОжидаемаяЦель.Видимость = Ложь;
			Если Не уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
				Форма.Элементы.Тема.СписокВыбора.Добавить(НСтр("ru='Мобильное приложение ""Водитель УАТ""'"), НСтр("ru='Мобильное приложение ""Водитель УАТ""'"));
				Форма.Элементы.Тема.СписокВыбора.Добавить(НСтр("ru='Маршрутизация Rarus VRP'"), НСтр("ru='Маршрутизация Rarus VRP'"));
			КонецЕсли;
			Форма.Элементы.Тема.СписокВыбора.Добавить(НСтр("ru='Электронные перевозочные документы'"), НСтр("ru='Электронные перевозочные документы'"));
			Форма.Элементы.Тема.РедактированиеТекста = Ложь;
			Форма.Элементы.Тема.КнопкаВыпадающегоСписка = Истина;
			Форма.Элементы.Тема.РежимВыбораИзСписка = Истина;
			
			// Совместимость с прошлыми наименованиями
			Если Форма.Запись.Тема = НСтр("ru = 'Заявка на подключение маршрутизации Рарус VRP'; en = 'Request for connection to Rarus VRP routing'") Тогда
				Форма.Запись.Тема = НСтр("ru = 'Маршрутизация Rarus VRP'");
			ИначеЕсли Форма.Запись.Тема = НСтр("ru = 'Заявка на подключение мобильного приложения ""Водитель УАТ""'; en = 'Application for connecting the mobile application ""UAT Driver""'") Тогда
				Форма.Запись.Тема = НСтр("ru = 'Мобильное приложение ""Водитель УАТ""'");
			КонецЕсли;
			
			Если ЭтоЗавякаНаПодключениеВодительУАТ Тогда
				// Для мобильного приложения создадим новые реквизиты и заполним их
				
				СоздатьРеквизитыМобПриложения(Форма);
				
				Прикрепления = ПрикрепленияХЗ.Получить();
				Прикрепления = ?(Прикрепления = Неопределено, Новый Массив, Прикрепления);
				Для каждого ТекПрикрепление Из Прикрепления Цикл
					Если ТипЗнч(ТекПрикрепление) <> Тип("Структура") Или (ТипЗнч(ТекПрикрепление) = Тип("Структура") И Не ТекПрикрепление.Свойство("ДопИнформацияМобПриложение")) Тогда
						Продолжить;
					КонецЕсли;
					
					Форма.ВариантРаботы = ТекПрикрепление.ДопИнформацияМобПриложение.ВариантРаботы;
					Форма.ПолучитьБесплатнуюЛицензию = ТекПрикрепление.ДопИнформацияМобПриложение.ПолучитьБесплатнуюЛицензию;
					Прервать;
					
				КонецЦикла;
				
				// Если не заполнен вариант работы устанавливаем первый в списке
				Если Не ЗначениеЗаполнено(Форма.ВариантРаботы) Тогда
					Форма.ВариантРаботы = НСтр("ru='Облачный сервер'");
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			Форма.Элементы.ОписаниеДействия.Заголовок = НСтр("ru = 'Какая задача решается и зачем (бизнес-потребность)'; en = 'What problem is being solved and why (business need)'");
		КонецЕсли;
		
	ИначеЕсли Форма.ИмяФормы = "Обработка.пр_ПоддержкаОтраслевыхРешений.Форма.КонтактыСлужбыПоддержки" Тогда
		Форма.Элементы.ЗаголовокСайты.Ширина = 6;
		
	ИначеЕсли Форма.ИмяФормы = "Обработка.ЛегальностьПолученияОбновлений.Форма.ПроверкаЛегальностиПолученияОбновления" Тогда
		Форма.РазрешитьОтправкуСтатистики = Истина;
		Форма.Элементы.ГруппаОтправкаСтатистики.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Переопределяемая процедура, вызываемая из одноименной процедуры формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма контактов службы поддержки.
//
Процедура НастроитьФормуПоВидуОбращения(Форма) Экспорт
	
	Если Форма.Запись.Тема = НСтр("ru='Мобильное приложение ""Водитель УАТ""'") И Форма.Элементы.Найти("ВариантРаботы") = Неопределено Тогда
		СоздатьРеквизитыМобПриложения(Форма);
		Форма.ВариантРаботы = НСтр("ru='Облачный сервер'");
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ВариантРаботы") <> Неопределено Тогда
		Форма.Элементы.ВариантРаботы.Видимость = Форма.Запись.Тема = НСтр("ru='Мобильное приложение ""Водитель УАТ""'");
		Форма.Элементы.ПолучитьБесплатнуюЛицензию.Видимость = (Форма.Запись.Тема = НСтр("ru='Мобильное приложение ""Водитель УАТ""'") И Форма.ВариантРаботы = НСтр("ru='Облачный сервер'"));
	КонецЕсли;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименной процедуры формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма контактов службы поддержки
//  Прикрепления - Массив - Массив дополнительной информации.
//
Процедура ПередЗаписьюНаСервере(Форма, Прикрепления) Экспорт
	
	Если Форма.Запись.Тема = НСтр("ru='Мобильное приложение ""Водитель УАТ""'") Тогда
		ДопИнформацияМобПриложение = Новый Структура("ВариантРаботы,ПолучитьБесплатнуюЛицензию");
		ДопИнформацияМобПриложение.ВариантРаботы = Форма.ВариантРаботы;
		ДопИнформацияМобПриложение.ПолучитьБесплатнуюЛицензию = Форма.ПолучитьБесплатнуюЛицензию;
		Прикрепления.Добавить(Новый Структура("ДопИнформацияМобПриложение", ДопИнформацияМобПриложение));
	КонецЕсли;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из процедуры модуля менеджера записи.
//
// Параметры:
//  Обращение - Структура - Структура содержащая поля для отправки обращения
//  Прикрепления - Массив - Массив прикрепленой дополнительной информации.
//
Процедура ПрикрепитьДополнительнуюИнформацию(Обращение, Прикрепления) Экспорт
	
	Если Обращение.Тема = НСтр("ru='Мобильное приложение ""Водитель УАТ""'") Тогда
		Для каждого ТекПрикрепление Из Прикрепления Цикл
			
			Если ТипЗнч(ТекПрикрепление) <> Тип("Структура") Или (ТипЗнч(ТекПрикрепление) = Тип("Структура") И Не ТекПрикрепление.Свойство("ДопИнформацияМобПриложение")) Тогда
				Продолжить;
			КонецЕсли;
			
			ВариантРаботы = ТекПрикрепление.ДопИнформацияМобПриложение.ВариантРаботы;
			ПолучитьБесплатнуюЛицензию = ТекПрикрепление.ДопИнформацияМобПриложение.ПолучитьБесплатнуюЛицензию;
			
			ТекстДополнительнойИнформации = НСтр("ru='Вариант работы: %1'");
			ТекстДополнительнойИнформации = СтрЗаменить(ТекстДополнительнойИнформации, "%1", ВариантРаботы);
			Если ВариантРаботы = НСтр("ru='Облачный сервер'") Тогда
				ТекстДополнительнойИнформации = ТекстДополнительнойИнформации + Символы.ПС + НСтр("ru='Бесплатная лицензия: %2'");
				ТекстБесплатнойЛицензии = ?(ПолучитьБесплатнуюЛицензию, НСтр("ru='Да'"), НСтр("ru='Нет'"));
				ТекстДополнительнойИнформации = СтрЗаменить(ТекстДополнительнойИнформации, "%2", ТекстБесплатнойЛицензии);
			КонецЕсли;
			
			Обращение.ОписаниеДействия = СтрШаблон("%1
			|
			|%2", Обращение.ОписаниеДействия, ТекстДополнительнойИнформации);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура СоздатьРеквизитыМобПриложения(Форма)
	
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты = Новый Массив;
	
	// Опишем ревизиты формы
	Реквизит_ВариантРаботы = Новый РеквизитФормы("ВариантРаботы", Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(300)),,"Вариант работы", Истина);
	Реквизит_ПолучениеБесплатнойЛицензии = Новый РеквизитФормы("ПолучитьБесплатнуюЛицензию", Новый ОписаниеТипов("Булево")
	,,"Получить бесплатную лицензию", Истина);
	
	// Заполним массив после описания реквизитов формы
	ДобавляемыеРеквизиты.Добавить(Реквизит_ВариантРаботы);
	ДобавляемыеРеквизиты.Добавить(Реквизит_ПолучениеБесплатнойЛицензии);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ИмяЭлемента = "ВариантРаботы";
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		ЭлементФормы = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма.Элементы.ТемаЗаголовок);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеПереключателя;
		ЭлементФормы.ВидПереключателя = ВидПереключателя.Тумблер;
		ЭлементФормы.СписокВыбора.Добавить(НСтр("ru='Облачный сервер'"),НСтр("ru='Облачный сервер'"));
		ЭлементФормы.СписокВыбора.Добавить(НСтр("ru='Корпоративный сервер'"),НСтр("ru='Корпоративный сервер'"));
		ЭлементФормы.ПутьКДанным = "ВариантРаботы";
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		ЭлементФормы.ШрифтЗаголовка = Форма.Элементы.Пользователь.ШрифтЗаголовка;
		ЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ВариантРаботыПриИзменении");
	КонецЕсли;
	
	Форма.Элементы.Переместить(ЭлементФормы, Форма.Элементы.ТемаЗаголовок, Форма.Элементы.КонтактыПользователя);
	
	ИмяЭлемента = "ПолучитьБесплатнуюЛицензию";
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		ЭлементФормы = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма.Элементы.ТемаЗаголовок);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
		ЭлементФормы.ПутьКДанным = "ПолучитьБесплатнуюЛицензию";
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	КонецЕсли;
	
	Форма.Элементы.Переместить(ЭлементФормы, Форма.Элементы.ТемаЗаголовок, Форма.Элементы.КонтактыПользователя);
	
КонецПроцедуры
